---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetX
source: html/efe34571-e336-628d-93a7-0c40cf3cd682.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile2OffsetX Property

"Horizontal Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile2OffsetX { get; }
```